app/controllers/formfuctions_controller.rb

    def show
        @user = User.find(current_user.id)
        @form = Form.find_by(user_id: current_user.id)
        @who = Who.find(@form.who_id)
        @activity = Activity.find(@form.activity_id)
        @type = Type.find(@form.type_id)
        @functions = Function.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "forms".* FROM "forms" WHERE "forms"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT  "whos".* FROM "whos" WHERE "whos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "forms".* FROM "forms" WHERE "forms"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT  "types".* FROM "types" WHERE "types"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "functions".* FROM "functions"

    def create
        @form = Form.find_by(user_id: current_user.id)
        @function_id = params[:number]


        @formfuction = Formfuction.new
        @formfuction.form_id = @form.id
        @formfuction.function_id = @function_id



        if @formfuction.save
---
SELECT  "forms".* FROM "forms" WHERE "forms"."user_id" = $1 LIMIT $2  [["user_id", 4], ["LIMIT", 1]]
INSERT INTO "formfuctions" ("form_id", "function_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["form_id", 6], ["function_id", 18], ["created_at", "2019-03-19 13:16:36.227404"], ["updated_at", "2019-03-19 13:16:36.227404"]]

    def destroy
        @form = Form.find_by(user_id: current_user.id)
        @function_id = params[:number]
        @formfuction = Formfuction.find_by(function_id: @function_id, form_id: @form.id)


        if @formfuction.destroy
---
SELECT  "forms".* FROM "forms" WHERE "forms"."user_id" = $1 LIMIT $2  [["user_id", 4], ["LIMIT", 1]]
SELECT  "formfuctions".* FROM "formfuctions" WHERE "formfuctions"."function_id" = $1 AND "formfuctions"."form_id" = $2 LIMIT $3  [["function_id", 1], ["form_id", 6], ["LIMIT", 1]]
DELETE FROM "formfuctions" WHERE "formfuctions"."id" = $1  [["id", 4]]