app/controllers/forms_controller.rb

SELECT  "guests".* FROM "guests" WHERE "guests"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
SELECT  "forms".* FROM "forms" WHERE "forms"."guest_id" = $1 LIMIT $2  [["guest_id", 24], ["LIMIT", 1]]
UPDATE "forms" SET "activity_id" = $1, "updated_at" = $2 WHERE "forms"."id" = $3  [["activity_id", 2], ["updated_at", "2019-03-17 21:02:22.245619"], ["id", 25]]
---
    def create
        @find_guest = Guest.find(params[:guest_id])
        @number = params[:number]

        @id_form = Form.find_by(guest_id: @find_guest.id)


        @id_form.activity_id = @number



          if @id_form.save

SELECT  "guests".* FROM "guests" WHERE "guests"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
SELECT  "guests".* FROM "guests" WHERE "guests"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
SELECT  "forms".* FROM "forms" WHERE "forms"."guest_id" = $1 LIMIT $2  [["guest_id", 23], ["LIMIT", 1]]
---
    def show

        @id_guest = Guest.find(params['id'])
        @find_guest = Guest.find(params[:guest_id])
        @id_form = Form.find_by(guest_id: @find_guest.id)