app/controllers/functions_controller.rb

    def show
        @user = User.find(current_user.id)
        @form = Form.find_by(user_id: current_user.id)
        @who = Who.find(@form.who_id)
        @activity = Activity.find(@form.activity_id)
        @type = Type.find(@form.type_id)
        @functions = Function.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "forms".* FROM "forms" WHERE "forms"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT  "whos".* FROM "whos" WHERE "whos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "types".* FROM "types" WHERE "types"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "functions".* FROM "functions"