app/controllers/guests_controller.rb

    def show
        @id_guest = Guest.find(params['id'])
---
SELECT  "guests".* FROM "guests" WHERE "guests"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

    def create

       @number = params[:number]
       @last_guest_id = Guest.last.id


        @guest = Guest.new
        @form = Form.new
        @form.guest_id = @last_guest_id +1
        @form.who_id = @number



         if @guest.save && @form.save
---
SELECT  "guests".* FROM "guests" ORDER BY "guests"."id" DESC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "forms" ("guest_id", "who_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["guest_id", 2], ["who_id", 2], ["created_at", "2019-03-19 10:51:58.348892"], ["updated_at", "2019-03-19 10:51:58.348892"]]
INSERT INTO "guests" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2019-03-19 10:51:58.340157"], ["updated_at", "2019-03-19 10:51:58.340157"]]