app/controllers/registrations_controller.rb

    def add_formuser
        if resource.persisted?
            @id_guest = Guest.last.id
            @id_user = User.last.id
            @form = Form.find_by(guest_id: @id_guest)
            if @form
                if @form.user_id == nil
                    @form.user_id = current_user.id
                    @form.save
---
SELECT  "guests".* FROM "guests" ORDER BY "guests"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT  "forms".* FROM "forms" WHERE "forms"."guest_id" = $1 LIMIT $2  [["guest_id", 2], ["LIMIT", 1]]
UPDATE "forms" SET "user_id" = $1, "updated_at" = $2 WHERE "forms"."id" = $3  [["user_id", 1], ["updated_at", "2019-03-19 10:52:16.163652"], ["id", 1]]

    def delete_form_guest
        @empty_forms = Form.where(type_id: nil )
        @empty_forms.each do |form|
---
SELECT  "forms".* FROM "forms" WHERE "forms"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]