app/controllers/types_controller.rb

SELECT  "guests".* FROM "guests" WHERE "guests"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "forms".* FROM "forms" WHERE "forms"."guest_id" = $1 LIMIT $2  [["guest_id", 2], ["LIMIT", 1]]
UPDATE "forms" SET "type_id" = $1, "updated_at" = $2 WHERE "forms"."id" = $3  [["type_id", 1], ["updated_at", "2019-03-19 10:52:02.463913"], ["id", 1]]
---
    def create
        @find_guest = Guest.find(params[:guest_id])
        @type_id = params[:type_id]

        @id_form = Form.find_by(guest_id: @find_guest.id)
        @formuser = Formuser.find_by(guest_id: @find_guest.id)

        @id_form.type_id = @type_id
        @formuser.type_id = @type_id






          if @id_form.save && @formuser.save